# GetRowHeightInPixels Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..GetRowHeightInPixels Method
TableSectionData Class See Also
---
This returns a row's height in logical pixels
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int GetRowHeightInPixels(
	int nRow
)
```

Visual Basic
---
```text
Public Function GetRowHeightInPixels ( _
	nRow As Integer _
) As Integer
```

Visual C++
---
```text
public:
int GetRowHeightInPixels(
	int nRow
)
```

# ### Parameters
nRow
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given row number nRow is invalid. |

# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace